<?php

use \yii\bootstrap\Modal;
use kartik\social\FacebookPlugin;
use \yii\bootstrap\Collapse;
use \yii\bootstrap\Alert;
use yii\helpers\Html;

/* @var $this yii\web\View */
$this->title = 'MathMaps';
?>

<div class="site-index">
    <div class="jumbotron">
        <h1>Вітаємо на MathMaps <i class="fa fa-globe"></i>!</h1>
        <p class="lead">
            Відкрий для себе світ математики із картами MathMaps.
        </p>
        <?php
        echo Html::a(
            'Перейти до записів',
            ['note/index'],
            ['class' => 'btn btn-lg btn-success']
        );
        ?>
    </div>
    <div class="row">
        <div class="col-md-7">
            <h1>Дивись на речі широко</h1>
            <p>
                Тепер не потрібно листати всі підручники і конспекти, щоб знати більше.
                Прямо на сторінці з записом, можна знайти всі необхідні факти,
                щоб вивчити вибране поняття. Поглянь на карту запису
                щоб побачити всю інформацію в базі MathMaps, яка базується на ньому.
            </p>
            <p>
                Разом із MathMaps математика просто як на лодоні.
            </p>
            <p>
            <?=Html::a('Перейти до записів', ['/note'], ['class' => 'btn btn-default']); ?>
            </p>
        </div>
    </div>
    <div class="row">
        <div class="col-md-7 pull-right">
            <h1>Тримай навчання під контролем</h1>
            <p>
                Вчишся так багато, що вже не пам'ятаєш що вивчив, а що ні?
                Візьми навчання під контроль.
                З допомогою MathMaps ти можеш легко керувати записами, які вивчаєш.
                Знаходь нові записи в базі MathMaps або створюй власні.
                Додавай потрібні факти в свій список, просто ділячи їх за успіхами вивчення.
            </p>
            <p>
                Разом із MathMaps отримуй впевненість в своїх знаннях.
            </p>
            <p>
                <?=Html::a('Перейти до списку', ['/note/user-list'], ['class' => 'btn btn-default']); ?>
            </p>
        </div>
    </div>
    <div class="row">
        <div class="col-md-7">
            <h1>Прискорюйся</h1>
            <p>
                Не гай свій час, вивчаючи непотрібні речі.
                Відкинь лінійну структуру книг і відкрий для себе MathMaps.
                Просто знайди потрібний запис в базі MathMaps
                і побачиш на сторінці запису все, що потрібно для його вивчення.
                Знаходь найкорочший шлях з будь-якго місця.
            </p>
            <p>
                Разом із MathMaps навчайся ефективно.
            </p>
            <p>
                <?=Html::a('Перейти до прикладу', ['/note/user-list'], ['class' => 'btn btn-default']); ?>
            </p>
        </div>
    </div>
    <div class="row">
        <div class="col-md-7 pull-right">
            <h1>Відкривай нові території</h1>
            <p>
                Із допомогою бази карт MathMaps ти можеш відкривати для себе
                нові місця в математиці наче подорожуючи по світу.
                Знаходь нові карти, вивчай її території та отримуй нові враження від навчання.
            </p>
            <p>
                Разом із MathMaps подорожуй в навчанні.
            </p>
            <p>
                <?=Html::a('Перейти до карт (в розробці)', ['/'], ['class' => 'btn btn-default disabled']); ?>
            </p>
        </div>
    </div>
    <div class="row">
        <div class="col-md-7">
            <h1>Візьми знання з собою</h1>
            <p>
                Важкі книжки і тони конспектів не завжди під рукою.
                Натомість, MathMaps завжди в мережі і чекає на тебе.
                Заходь на MathMaps із свого смартфону, ПК чи планшету
                та навчайся коли забажаєш.
                Ти навіть можеш експортувати записи з бази MathMaps
                або свого списку в документи популярних форматів і роздрукувати.
            </p>
            <p>
                Разом із MathMaps математика завжди доступна.
            </p>
            <p>
                <?=Html::a('Перейти до експорту (в розробці)', ['/note/user-list'], ['class' => 'btn btn-default disabled']); ?>
            </p>
        </div>
    </div>
</div>



